from django.shortcuts import render
from django.http import HttpResponse
from django.urls import reverse
from django.http import HttpResponseRedirect
from hindi_chatbot_ui.polarity import polarity
from random import choice  



# Create your views here.
neu_list = ['इस बारे में और बताइये।', 'कृपया विस्तार में बताएं।', 'क्या आप इस बारे में और बता सकते हैं?']
pos_list = ['अति उत्तम!', 'मुझे यह जान कर बहुत अच्छा लगा!', 'यह तो अच्छी बात है!', 'सुन कर अच्छा लगा!']
neg_list = ['मुझे यह बताने के लिए धन्यवाद। आशा करता हूँ कि सब सही हो जाए।', 'बहुत निराशाजनक बात है...आशा करता हूँ कि सब सही हो जाए।', \
            'यह जान कर बहुत अफ़सोस हुआ...']
ques_list = ['आप अपने शारीरिक स्वास्थ के बारे में क्या कहेंगे?', 'आप अपने मानसिक स्वास्थ के बारे में क्या कहेंगे?']
sexhar_list = ['बदतमीज़ी', 'बलात्कार', 'यौन उत्पीड़न', 'यौन', 'उत्पीड़न',  'रेप', 'उत्पीड़न', 'बदसलूकी']
p_domvi_list = ['मारा', 'मारी', 'मारें', 'पीटा', 'पीटी', 'पीटें', 'चोट', 'घायल', 'धक्का', 'धक्के', 'थप्पड़']
m_domvi_list = ['दहेज', 'तंग', 'परेशान'] # ससुराल
choice_list = []
bot_list = []
user_list = []
 
def index(request):
    if request.method == "POST":
        message = request.POST['message']
        user_list.append(message)

        while message != "समाप्त":
            sh = False
            pdv = False 
            mdv = False
            msg_list = message.split()

            for i in msg_list:
                if '।' in i:
                        j = i.replace('।', '')
                        msg_list[msg_list.index(i)] = j

            for i in msg_list:
                count = 0
                if i in sexhar_list:
                    count += 1
                    if count > 0:
                        sh = True 
                if i in p_domvi_list:
                    count += 1
                    if count > 0:
                        pdv = True
                if i in m_domvi_list:
                    count += 1
                    if count > 0:
                        mdv = True 
            
    
            # NEGATIVE
            if (polarity(message)[1]) < 0 and sh == True:
                bot_list.append('उच्च संभावना है की आप के साथ यौन उत्पीड़न हो रहा है। क्या आप ने उत्पीड़क को वही के वही बोलने की कोशिश करी कि यह हरकतें ग़लत हैं? (हाँ या नहीं में जवाब दीजिये।)')
            
            elif len(bot_list) > 0 and bot_list[-1] == 'उच्च संभावना है की आप के साथ यौन उत्पीड़न हो रहा है। क्या आप ने उत्पीड़क को वही के वही बोलने की कोशिश करी कि यह हरकतें ग़लत हैं? (हाँ या नहीं में जवाब दीजिये।)':
                if message == 'हाँ':
                    bot_list.append('परेशान होने की आवश्यक्ता नहीं है। शायद आप को यह मुश्किल लगेगा, लेकिन उत्पीड़न का विवरण उचित लोगो से करना ही आवश्यक कदम है। अगर यह भी उचित तरह से काम नहीं करता, तो आप नीचे दिये गए कदम ले सकती हैं: 1. उचित नागरिक अधिकार स्थापना में शिकायत दर्ज करें 2. कानूनी कार्रवाई करें। आप यह वार्तालाप \'समाप्त\' लिख कर ख़त्म कर सकती हैं।')
                elif message == 'नहीं':
                    bot_list.append('यह करने की कोशिश करें। आम तौर पर यौन शोषण की जड़ तक पहुँच कर, यानी उत्पीड़क को वही के वही बोलना पर्याप्त होता है। उत्पीड़न का विवरण उचित लोगो से करना ही आवश्यक कदम है। अगर यह भी उचित तरह से काम नहीं करता, तो आप नीचे दिये गए कदम ले सकती हैं: 1. उचित नागरिक अधिकार स्थापना में शिकायत दर्ज करें 2. कानूनी कार्रवाई करें। आप यह वार्तालाप \'समाप्त\' लिख कर ख़त्म कर सकती हैं।')
                else:
                    bot_list.append('हाँ या नहीं में जवाब दीजिये!')
            
            elif (polarity(message)[1]) < 0 and pdv == True:
                bot_list.append('उच्च संभावना है की आप के साथ शारीरिक घरेलू हिंसा हो रही है। क्या आप ने अपने ससुराल वालों को बोलने की कोशिश करी कि यह हरकतें ग़लत हैं? (हाँ या नहीं में जवाब दीजिये।)')
            
            elif len(bot_list) > 0 and bot_list[-1] == 'उच्च संभावना है की आप के साथ शारीरिक घरेलू हिंसा हो रही है। क्या आप ने अपने ससुराल वालों को बोलने की कोशिश करी कि यह हरकतें ग़लत हैं? (हाँ या नहीं में जवाब दीजिये।)':
                if message == 'हाँ':
                    bot_list.append('परेशान होने की आवश्यक्ता नहीं है। शायद आप को यह मुश्किल लगेगा, लेकिन ग़ैर सरकारी संगठन में शिकायत दर्ज करना ही आवश्यक कदम है। अगर यह भी उचित तरह से काम नहीं करता, तो आप नीचे दिये गए कदम ले सकती हैं: 1. घरेलू हिंसा हेल्पलाइन पर अपनी शिकायत बताएं और दर्ज करें 2. पुलिस स्टेशन में शिकायत दर्ज करें। आप यह वार्तालाप \'समाप्त\' लिख कर ख़त्म कर सकती हैं।')
                elif message == 'नहीं':
                    bot_list.append('यह करने की कोशिश करें। आम तौर पर घरेलू हिंसा की जड़ तक पहुँच कर, यानी ससुराल वालों को वही के वही बोलना पर्याप्त होता है। ग़ैर सरकारी संगठन में शिकायत दर्ज करना ही आवश्यक कदम है। अगर यह भी उचित तरह से काम नहीं करता, तो आप नीचे दिये गए कदम ले सकती हैं: 1. घरेलू हिंसा हेल्पलाइन पर अपनी शिकायत बताएं और दर्ज करें 2. पुलिस स्टेशन में शिकायत दर्ज करें। आप यह वार्तालाप \'समाप्त\' लिख कर ख़त्म कर सकती हैं।')
                else:
                    bot_list.append('हाँ या नहीं में जवाब दीजिये!')
            
            elif (polarity(message)[1]) < 0 and mdv == True:
                bot_list.append('उच्च संभावना है की आप के साथ मानसिक घरेलू हिंसा हो रही है। क्या आप ने अपने ससुराल वालों को बोलने की कोशिश करी कि यह हरकतें ग़लत हैं? (हाँ या नहीं में जवाब दीजिये।)')
            
            elif len(bot_list) > 0 and bot_list[-1] == 'उच्च संभावना है की आप के साथ मानसिक घरेलू हिंसा हो रही है। क्या आप ने अपने ससुराल वालों को बोलने की कोशिश करी कि यह हरकतें ग़लत हैं? (हाँ या नहीं में जवाब दीजिये।)':
                if message == 'हाँ':
                    bot_list.append('परेशान होने की आवश्यक्ता नहीं है। शायद आप को यह मुश्किल लगेगा, लेकिन ग़ैर सरकारी संगठन में शिकायत दर्ज करना ही आवश्यक कदम है। अगर यह भी उचित तरह से काम नहीं करता, तो आप नीचे दिये गए कदम ले सकती हैं: 1. घरेलू हिंसा हेल्पलाइन पर अपनी शिकायत बताएं और दर्ज करें 2. पुलिस स्टेशन में शिकायत दर्ज करें। आप यह वार्तालाप \'समाप्त\' लिख कर ख़त्म कर सकती हैं।')
                elif message == 'नहीं':
                    bot_list.append('यह करने की कोशिश करें। आम तौर पर घरेलू हिंसा की जड़ तक पहुँच कर, यानी ससुराल वालों को वही के वही बोलना पर्याप्त होता है। ग़ैर सरकारी संगठन में शिकायत दर्ज करना ही आवश्यक कदम है। अगर यह भी उचित तरह से काम नहीं करता, तो आप नीचे दिये गए कदम ले सकती हैं: 1. घरेलू हिंसा हेल्पलाइन पर अपनी शिकायत बताएं और दर्ज करें 2. पुलिस स्टेशन में शिकायत दर्ज करें। आप यह वार्तालाप \'समाप्त\' लिख कर ख़त्म कर सकती हैं।')
                else:
                    bot_list.append('हाँ या नहीं में जवाब दीजिये!')

            elif (polarity(message)[1]) < 0 and 'आप अपने शारीरिक स्वास्थ के बारे में क्या कहेंगे?' in choice_list:
                bot_list.append(choice(neu_list))
            
            elif (polarity(message)[1]) < 0 and 'आप अपने मानसिक स्वास्थ के बारे में क्या कहेंगे?' in choice_list:
                bot_list.append(choice(neu_list))

            elif len(user_list) == 1 and (polarity(message)[1]) < 0:
                bot_list.append('मुझे यह जान कर दुख हुआ...आप को ऐसा क्यों लग रहा है?')
            
            elif ((polarity(message)[1]) < 0) and ('आप अपने मानसिक स्वास्थ के बारे में क्या कहेंगे?' in choice_list) and ('आप अपने शारीरिक स्वास्थ के बारे में क्या कहेंगे?' in choice_list):
                bot_list.append('चैटबॉट के प्रश्न विकास की प्रक्रिया में है। चैटबॉट का प्रयोग करने के लिए धन्यवाद। कृपया \'समाप्त\' लिख कर वार्तालाप ख़त्म करें।')
            
            elif ((polarity(message)[1]) > 0) and ('आप अपने मानसिक स्वास्थ के बारे में क्या कहेंगे?' in choice_list) and ('आप अपने शारीरिक स्वास्थ के बारे में क्या कहेंगे?' in choice_list):
                bot_list.append('चैटबॉट के प्रश्न विकास की प्रक्रिया में है। चैटबॉट का प्रयोग करने के लिए धन्यवाद। कृपया \'समाप्त\' लिख कर वार्तालाप ख़त्म करें।')
            
            elif (polarity(message)[1]) > 0 and 'आप अपने शारीरिक स्वास्थ के बारे में क्या कहेंगे?' in choice_list:
                bot_list.append('आप अपने मानसिक स्वास्थ के बारे में क्या कहेंगे?')
                choice_list.append('आप अपने मानसिक स्वास्थ के बारे में क्या कहेंगे?')

            elif (polarity(message)[1]) > 0 and 'आप अपने मानसिक स्वास्थ के बारे में क्या कहेंगे?' in choice_list:
                bot_list.append('आप अपने शारीरिक स्वास्थ के बारे में क्या कहेंगे?')
                choice_list.append('आप अपने शारीरिक स्वास्थ के बारे में क्या कहेंगे?')

            elif (polarity(message)[1]) < 0:
                question = choice(ques_list)
                bot_list.append(choice(neg_list) + ' ' + question)
                choice_list.append(question)

            
            # NEUTRAL
            elif (polarity(message)[1]) == 0.0:
                bot_list.append(choice(neu_list))  
            
            
            # POSITIVE
            elif (polarity(message)[1]) > 0:
                bot_list.append(choice(pos_list) + ' ' + choice(neu_list))
                    

            mylist = zip(bot_list, user_list)
            return HttpResponseRedirect(reverse("index"))
        bot_list.clear() 
        user_list.clear()
        choice_list.clear()

        return HttpResponseRedirect(reverse("index"))
    
    else:
        mylist = zip(bot_list, user_list)
        return render(request, "hindi_chatbot_ui/index.html", {
            "mylist": mylist
        })       